app/controllers/temperatures_controller.rb

SELECT "temperatures".* FROM "temperatures"
---
  def index
    @temperatures = Temperature.all

INSERT INTO "temperatures" ("average_high_f", "average_low_f", "created_at", "updated_at", "location_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["average_high_f", 50], ["average_low_f", 20], ["created_at", "2021-01-18 22:27:09.135910"], ["updated_at", "2021-01-18 22:27:09.135910"], ["location_id", 1]]
---
  def create
    @temperature = Temperature.new(temperature_params)
    #this adds a :location_id key to temperature from the params
    @temperature.location_id = params[:location_id]

    if @temperature.save

DELETE FROM "temperatures" WHERE "temperatures"."id" = $1  [["id", 7]]
---
  def destroy
    @temperature.destroy

SELECT "temperatures".* FROM "temperatures" WHERE "temperatures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_temperature
      @temperature = Temperature.find(params[:id])